app/serializers/project_serializer.rb

  def filtered_tasks
    # debugger
    if @instance_options[:employee_id]
      current_employee = Employee.find_by(id: @instance_options[:employee_id])
      self.object.tasks.select{|task| task.employees.include?(current_employee)}
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "employees" INNER JOIN "employee_tasks" ON "employees"."id" = "employee_tasks"."employee_id" WHERE "employee_tasks"."task_id" = $1 AND "employees"."id" = $2 LIMIT $3  [["task_id", 22], ["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 4]]