app/serializers/task_serializer.rb

  def filtered_employeetask
    if @instance_options[:employee_id]
      current_employee = Employee.find_by(id: @instance_options[:employee_id])
      self.object.employee_tasks.find_by(employee_id: current_employee.id)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "employee_tasks".* FROM "employee_tasks" WHERE "employee_tasks"."task_id" = $1 AND "employee_tasks"."employee_id" = $2 LIMIT $3  [["task_id", 22], ["employee_id", 1], ["LIMIT", 1]]