app/controllers/application_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."username" = $1 LIMIT $2  [["username", "emp413"], ["LIMIT", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."username" = $1 LIMIT $2  [["username", "magyone"], ["LIMIT", 1]]
---
  def user_atm
    user_name = decoded_token[0]["user_name"]
    if user_name[0..2] == "emp"
      user = Employee.find_by(username: user_name)
    elsif user_name[0..2] == "mag"
      user = Manager.find_by(username: user_name)