app/controllers/employee_tasks_controller.rb

  def update
    # debugger
    currentTask = Task.find_by(id: params[:id])
    currentEmployee = Employee.find_by(username: user_atm[:username])
    et = currentTask.employee_tasks.find_by(employee_id: currentEmployee.id)
    et.update(hours_done: params[:hours_done])
    currentTask.total_working_done = currentTask.reload.employee_tasks.map{|employeetask| employeetask.hours_done}.sum.to_f
    # debugger
    currentTask.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "employees".* FROM "employees" WHERE "employees"."username" = $1 LIMIT $2  [["username", "emp413"], ["LIMIT", 1]]
SELECT  "employee_tasks".* FROM "employee_tasks" WHERE "employee_tasks"."task_id" = $1 AND "employee_tasks"."employee_id" = $2 LIMIT $3  [["task_id", 22], ["employee_id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "total_working_done" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["total_working_done", "2.0"], ["updated_at", "2019-08-28 23:29:14.843234"], ["id", 22]]
UPDATE "employee_tasks" SET "hours_done" = $1, "updated_at" = $2 WHERE "employee_tasks"."id" = $3  [["hours_done", "2.0"], ["updated_at", "2019-08-28 23:29:14.817514"], ["id", 52]]
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "employee_tasks".* FROM "employee_tasks" WHERE "employee_tasks"."task_id" = $1  [["task_id", 22]]