app/controllers/employees_controller.rb

  def show
    employee = Employee.find_by(username: user_atm[:username])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."username" = $1 LIMIT $2  [["username", "emp413"], ["LIMIT", 1]]