app/controllers/login_controller.rb

  def create
    username = params[:account] + params[:username]
    if username[0..2] == "emp"
      user = Employee.find_by(username: username)
    elsif username[0..2] == "mag"
      user = Manager.find_by(username: username)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."username" = $1 LIMIT $2  [["username", "emp413"], ["LIMIT", 1]]
SELECT  "managers".* FROM "managers" WHERE "managers"."username" = $1 LIMIT $2  [["username", "mag413"], ["LIMIT", 1]]