app/controllers/managers_controller.rb

SELECT "managers".* FROM "managers"
---
  def index
    managers = Manager.all

SELECT  "managers".* FROM "managers" WHERE "managers"."username" = $1 LIMIT $2  [["username", "magyone"], ["LIMIT", 1]]
---
  def show
    manager = Manager.find_by(username: user_atm[:username])