app/controllers/projects_controller.rb

  def create
    # debugger
    project = Project.create(project_params)
---
INSERT INTO "projects" ("name", "description", "manager_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Deploy to Heroku"], ["description", "wewewewewewe"], ["manager_id", 6], ["created_at", "2019-09-11 17:27:57.194024"], ["updated_at", "2019-09-11 17:27:57.194024"]]