app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "project_id", "total_working_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Upload Rails"], ["project_id", 11], ["total_working_time", "12.0"], ["created_at", "2019-09-11 17:28:58.921905"], ["updated_at", "2019-09-11 17:28:58.921905"]]
INSERT INTO "employee_tasks" ("task_id", "employee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["task_id", 47], ["employee_id", 1], ["created_at", "2019-09-23 20:47:32.661430"], ["updated_at", "2019-09-23 20:47:32.661430"]]
---
    task = Task.create(task_params)
    params[:checked_employee].each do |employee|
      EmployeeTask.create(employee_id: employee, task: task)